app/views/phenotypes/show.html.erb

	</tr>
<% @phenotype.user_phenotypes.each do |up| %>
	<tr>
		<td><%= link_to User.find_by_id(up.user_id).name, User.find_by_id(up.user_id)%></td>
---
SELECT "phenotypes".* FROM "phenotypes" WHERE "phenotypes"."user_id" = 2 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1