app/controllers/phenotypes_controller.rb

  def show
    #@phenotypes = Phenotype.where(:user_id => current_user.id).all
    #@title = "Phenotypes"
    @phenotype = Phenotype.find(params[:id]) || not_found
---
SELECT "phenotypes".* FROM "phenotypes" WHERE "phenotypes"."id" = 3 LIMIT 1