app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if not params[:read]
      flash[:warning] = "You must tick the box to proceed!"
    end

    if params[:read] && verify_recaptcha(model: @user) && @user.save
---
INSERT INTO "users" ("encrypted_password", "has_sequence", "sequence_link", "updated_at", "salt", "name", "created_at", "email") VALUES ('262c0ce925d79d6d883e4a280d62a86ddf072593c80cf13425df6e0cb6e37ae8', NULL, NULL, '2011-06-15 06:17:51.398207', '4727c50f499b1231db052eba640a6c808d4c85cc2c947847f8eb286ebe9e853e', 'philihij', '2011-06-15 06:17:51.398207', 'gedankenstuecke@msn.com')

  def show
    # showing a single user's page
    @user = User.find_by_id(params[:id]) || not_found
    @title = @user.name + "'s page"
    @first_name = @user.name.split.first
    @user_phenotypes = @user.user_phenotypes
    #@snps = @user.snps.order("#{sort_column} #{sort_direction}").paginate(:page => params[:page])
    @received_messages = @user.messages.where(sent: false).order('created_at DESC')
    @sent_messages = @user.messages.where(:sent => true).order('created_at DESC')
    @phenotype_comments = PhenotypeComment.where(:user_id => @user.id).paginate(:page => params[:page])
    @snp_comments = SnpComment.where(:user_id => @user.id)

    # get phenotypes that current_user did not enter yet
    @unentered_phenotypes = Phenotype.all - @user.phenotypes
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "phenotypes".* FROM "phenotypes" WHERE "phenotypes"."user_id" = 1 LIMIT 1
SELECT "phenotypes".* FROM "phenotypes" WHERE "phenotypes"."id" = 2 LIMIT 1