app/controllers/users_controller.rb

INSERT INTO "phenotypes" ("user_id", "variations") VALUES (NULL, '---
---
	def create
		@user = User.new(params[:user])
		@phenotype = Phenotype.create(:user_id => @user.id)